
===========================================================================
report_checks -unconstrained
===========================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= Typical Corner ===================================



===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 9 unannotated drivers.
 SEL2
 analog_io1
 analog_io2
 analog_io3
 io_in[0]
 io_in[1]
 io_in[2]
 io_in[3]
 io_in[4]
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
Warning: There are 9 input ports missing set_input_delay.
  SEL2
  analog_io1
  analog_io2
  analog_io3
  io_in[0]
  io_in[1]
  io_in[2]
  io_in[3]
  io_in[4]
Warning: There are 3 unconstrained endpoints.
  analog_io1
  analog_io2
  analog_io3
